rails/app/controllers/api/entries_controller.rb

	  def index
	  	@track = Track.find(params[:track_id])
---
SELECT  "tracks".* FROM "tracks"  WHERE "tracks"."id" = ? LIMIT 1  [["id", 2]]