rails/app/controllers/api/tracks_controller.rb

SELECT "tracks".* FROM "tracks"
---
	  def index
	  	render json: Track.all

SELECT  "tracks".* FROM "tracks"  WHERE "tracks"."id" = ? LIMIT 1  [["id", 1]]
---
	  def show
	  	render json: Track.find(params[:id])