rails/app/controllers/tracks_controller.rb

SELECT "tracks".* FROM "tracks"
---
	def index
		p params

		@tracks = Track.all