rails/app/controllers/users_controller.rb

	def create
		@new_user = User.new(user_params)
		if @new_user.save
---
INSERT INTO "users" ("created_at", "email", "hashed_password", "updated_at", "username") VALUES (?, ?, ?, ?, ?)